Revit 2024 API
BuiltInFailures.ArrayFailures.CannotCreateArraySelectionIsGrouped Property
 Can't create an array because the selection cannot be grouped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateArraySelectionIsGrouped { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateArraySelectionIsGrouped As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateArraySelectionIsGrouped {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace